<HTML>

<BODY text="#275856">

<basefont size="4" color="#2F4958" face="arial">

<H1>La fen&ecirc;tre principale de JabRef</H1>

<em>Note&nbsp;:</em> La plupart des menus dont il est question dans les
paragraphes suivants ont des raccourcis claviers, et beaucoup sont accessibles
depuis la barre d'outils. Les raccourcis clavier sont affich&eacute;s dans les menus
d&eacute;roulants.

<p>
Ceci est la fen&ecirc;tre principale &agrave; partir de laquelle vous travaillez avec vos
bases de donn&eacute;es. En dessous de la barre de menus et de la barre d'outils se
trouve un panneau &agrave; onglets contenant un onglet pour chacune de vos
bases de donn&eacute;es actuellement ouvertes. Quand vous s&eacute;lectionnez un de ces
onglets, un tableau appara&icirc;t, listant toutes les entr&eacute;es de la base de
donn&eacute;es, ainsi qu'une s&eacute;lection configurable de leurs champs.
<ul>
<li>Vous d&eacute;cidez des champs affich&eacute;s dans ce tableau en cochant les
champs que vous voulez voir dans la fen&ecirc;tre de dialogue <strong>Pr&eacute;f&eacute;rences</strong>.</li>
<li>Les champs peuvent &ecirc;tre &eacute;dit&eacute;s directement dans le tableau, en cliquant
simplement dans la cellule et en tapant le contenu
(ce mode d'&eacute;dition est possible uniquement si "Autoriser l'&eacute;dition dans les cellules
du tableau" est coch&eacute;e dans <strong>Options -->
Pr&eacute;f&eacute;rences --> G&eacute;n&eacute;ral</strong>).
Double-cliquez dans la cellule pour utiliser un mode d'&eacute;dition plus puissant. Vous pouvez naviguer
dans le tableau en utilisant les fl&egrave;ches du clavier.</li>
<li>Le tableau est tri&eacute; selon une s&eacute;rie de champs de votre choix. L'ordre de tri par d&eacute;faut est configur&eacute; dans <strong>Options -> Pr&eacute;f&eacute;rences -> Table des entr&eacute;es</strong> mais vous pouvez changer rapidement et simplement cet ordre en double-cliquant sur le titre d'une colonne pour d&eacute;finir le crit&egrave;re de tri principal et en simple-cliquant sur le titre pour ajouter un nouveau sous-crit&egrave;re de tri. Si vous cliquez sur le titre d'une colonne qui est d&eacute;j&agrave; s&eacute;lectionn&eacute;e comme crit&egrave;re de tri, le sens de tri est invers&eacute;.
<li>Vous pouvez ajuster la largeur des colonnes en faisant glisser les limites
entre les ent&ecirc;tes.</li>
<li>Dans la fen&ecirc;tre de dialogue <strong>Pr&eacute;f&eacute;rences</strong>, choisissez si le tableau
doit &ecirc;tre redimensionn&eacute; pour s'ajuster &agrave; la fen&ecirc;tre. S&eacute;lectionnez cette option
pour toujours voir l'ensemble du tableau, et d&eacute;s&eacute;lectionner l&agrave; pour permettre
l'affichage de plus d'informations.</li>
<li>Les codes de couleurs vous aident &agrave; visualiser l'&eacute;tat
de votre base de donn&eacute;es. Les cellules sont color&eacute;es de la
fa&ccedil;on suivante&nbsp;:
  <ul>
  <li>Une cellule <font color="red">rouge</font> dans la colonne
  la plus &agrave; gauche signale une entr&eacute;e incompl&egrave;te.</li>
  <li>Une cellule <font color="#909000">jaune</font> dans la colonne
  la plus &agrave; gauche signale une entr&eacute;e qui ne d&eacute;finit pas par elle-m&ecirc;me
  l'ensemble des champs requis, mais qui contient un renvoi.</li>
  <li>Une cellule <font color="blue">bleue</font> correspond &agrave; un champ requis.</li>
  <li>Une cellule <font color="green">verte</font> correspond &agrave; un champ optionnel.</li>
  <li>Une cellule sans couleur correspond &agrave; un champ qui n'est pas utilis&eacute;
  par le programme <em>BibTeX</em> pour ce type d'entr&eacute;e. Le champ peut cependant
  &ecirc;tre &eacute;dit&eacute; dans JabRef.</li>
  </ul>
</li>
Les codes de couleurs peuvent &ecirc;tre modifi&eacute;s dans la fen&ecirc;tre de dialogue
<strong>Pr&eacute;f&eacute;rences</strong>. 

</ul>

<H2>Ajouter une nouvelle entr&eacute;e</H2>
Il y a plusieurs fa&ccedil;ons d'ajouter une nouvelle entr&eacute;e. L'activation du menu
<strong>BibTeX/ Nouvelle entr&eacute;e</strong> affiche une fen&ecirc;tre de dialogue o&ugrave; vous pouvez
choisir le type d'entr&eacute;e &agrave; partir d'une liste. Pour &eacute;viter cette fen&ecirc;tre
de dialogue, vous pouvez utilisez le menu <strong>BibTeX/ Nouvelle entr&eacute;e...</strong>
ainsi que des raccourcis clavier pour les types les plus courants.

<P>Lorsqu'une nouvelle entr&eacute;e est ajout&eacute;e, par d&eacute;faut, une 
<a href="EntryEditorHelp.html">fen&ecirc;tre d'&eacute;dition</a> s'ouvre. Ce comportement
peut &ecirc;tre modifi&eacute; dans la fen&ecirc;tre de dialogue <strong>Pr&eacute;f&eacute;rences</strong>.
<P><em>Note&nbsp;:</em> Nous vous recommandons fortement d'apprendre les
raccourcis clavier des types d'entr&eacute;es que vous utilisez le plus souvent,
tel que CTRL-SHIFT-A pour l'ajout d'une entr&eacute;e <em>article</em>.

<H2>Editer une entr&eacute;e</H2> Pour ouvrir la <a
href="EntryEditorHelp.html">fen&ecirc;tre d'&eacute;dition</a> sur une entr&eacute;e existante, 
double-cliquez simplement dans la colonne la plus &agrave; gauche sur la ligne
correspondante &agrave; l'entr&eacute;e, ou s&eacute;lectionner l'entr&eacute;e et appuyez sur ENTER.
Si "Autoriser l'&eacute;dition dans les cellules du tableau" n'est pas coch&eacute;
dans la fen&ecirc;tre de dialogue <strong>Options -->
Pr&eacute;f&eacute;rences --> G&eacute;n&eacute;ral</strong>, un double-clic n'importe
o&ugrave; sur la ligne correspondant &agrave; l'entr&eacute;e ouvrira la fen&ecirc;tre d'&eacute;dition.

<H2>R&eacute;f&eacute;rencer une cha&icirc;ne <em>BibTeX</em> dans un champ</H2>
Dans JabRef vous &eacute;crivez le contenu de tous les champs de la m&ecirc;me 
fa&ccedil;on que dans un &eacute;diteur de texte, &agrave; une exception pr&egrave;s&nbsp;: pour
r&eacute;f&eacute;rencer une cha&icirc;ne, entourer le nom de la cha&icirc;ne avec le caract&egrave;re #,
tel que dans&nbsp;:<BR>
&nbsp;&nbsp;'#jan# 1997',<BR>
ce qui sera interpr&eacute;t&eacute; comme la cha&icirc;ne nomm&eacute;e 'jan' suivie de '1997'.
<P>Voir aussi&nbsp;: <a href="StringEditorHelp.html">Editeur de cha&icirc;ne</a>.

</font>

</BODY>
</HTML>
