<HTML>

<BODY text="#275856">
<basefont size="4" color="#2F4958" face="arial">

<H1>A propos de <em>BibTeX</em></H1>

JabRef vous aide &agrave; travailler avec vos bases de donn&eacute;es <em>BibTeX</em>,
mais certaines r&egrave;gles doivent &ecirc;tre gard&eacute;es &agrave; l'esprit lorsque vous
&eacute;ditez vos entr&eacute;es afin le traitement correct de vos bases de donn&eacute;es par le programme <em>BibTeX</em>.

<H2>Les champs <em>BibTeX</em></H2>

Il y a un grand nombre de champs possibles dans <em>BibTeX</em>, et
quelques champs en plus que vous pouvez param&eacute;trer dans JabRef.

<P>
G&eacute;n&eacute;ralement, vous pouvez utiliser des commandes LaTeX &agrave; l'int&eacute;rieur
de champs contenant du texte. <em>BibTeX</em> formatera automatiquement
vos listes de r&eacute;f&eacute;rences et les champs qui sont inclus dans ces
listes seront mis en majuscules/minuscules selon votre style bibliographique. Pour &ecirc;tre certain que certains caract&egrave;res restent en majuscules, encadrez-les
par des accolades, comme dans le mot {B}elgique.

<P>
Notes &agrave; propos de certains types de champs&nbsp;:
<ul>
<li><em>Author</em>&nbsp;: Ce champ doit contenir la liste compl&egrave;te
des auteurs de votre entr&eacute;e. Les noms sont s&eacute;par&eacute;s par le mot
<em>and</em> m&ecirc;me s'il y a plus de deux auteurs. Chaque nom peut
&ecirc;tre &eacute;crit indiff&eacute;remment selon une des deux formes suivantes&nbsp;:<br>
 Donald E. Knuth <em>ou</em> Knuth, Donald E.<br>
 Eddie van Halen <em>ou</em> van Halen, Eddie<br>

La seconde forme doit &ecirc;tre utilis&eacute;e pour les auteurs qui ont des noms
compos&eacute;s (afin de diff&eacute;rencier entre pr&eacute;noms et noms).
 
<li><em>Editor</em>&nbsp;: Ce champ est analogue au champ <em>author</em>.

<li><em>Year</em>&nbsp;: Ann&eacute;e de la publication. Ce champ est requis pour
la plupart des types d'entr&eacute;es. 

<li><em>Bibtexkey</em>&nbsp;: C'est une cha&icirc;ne unique utilis&eacute;e pour r&eacute;f&eacute;rencer
l'entr&eacute;e dans les documents LaTeX. Notez que lorsque vous r&eacute;f&eacute;rencez une entr&eacute;e
dans LaTeX, la clef doit respecter la casse (majuscules/minuscules) de la cha&icirc;ne
de r&eacute;f&eacute;rence.

</ul>


</HTML>
