<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
  <head>
    <title>Personnaliser les types d'entr&eacute;es</title>
  </head>

  <BODY text="#275856">
    <basefont size="4" color="#2F4958" face="arial">

    <h1>Personnaliser les types d'entr&eacute;es</h1>
    <p>
    [NdT: pour acc&eacute;der &agrave; cette fonction, cliquez sur le menu 
    <strong>Options/ Personnaliser les types d'entr&eacute;es</strong>]
    <p>
    Lors de la personnalisation d'un type d'entr&eacute;e, vous d&eacute;finissez &agrave; la fois son apparence
    dans l'&eacute;diteur d'entr&eacute;es et ce qui est n&eacute;cessaire pour que JabRef consid&egrave;re une entr&eacute;e comme
    compl&egrave;te. Vous pouvez aussi bien changer les types d'entr&eacute;e existants qu'en d&eacute;finir de nouveaux.
    <p>
    <h2>Utiliser la fen&ecirc;tre de personnalisation des entr&eacute;es</h2> 
    
[NdT: L'interface a chang&eacute; depuis la version 1.7b] 

Dans la partie sup&eacute;rieure gauche de la fen&ecirc;tre se trouve une liste o&ugrave;
vous pouvez s&eacute;lectionner un des types d'entr&eacute;es actuellement d&eacute;finis.
Toutes les entr&eacute;es personnalis&eacute;es, qu'elles correspondent &agrave; de nouveaux
types ou &agrave; des types standard red&eacute;finis, sont affich&eacute;es avec un
ast&eacute;risque (*) &agrave; la fin de leur nom.

<p>S&eacute;lectionner un type d'entr&eacute;es ne fait qu'afficher ses champs
requis et optionnels, vous donnant un mod&egrave;le pour la
personnalisation. Vous pouvez alors changer &agrave; la fois la d&eacute;finition
et le nom de ce type d'entr&eacute;e avant de le sauver. Si le nom
apparaissant dans le champ texte <em>Nom</em>
est diff&eacute;rent de celui du type s&eacute;lectionn&eacute;,
le champ <em>Nom</em> est prioritaire quand vous cliquez sur
<em>Enregistrer</em> ou <em>Supprimer les d&eacute;finitions personnalis&eacute;es</em>.

<p>Vous pouvez supprimer un type d'entr&eacute;es personnalis&eacute; en le
s&eacute;lectionnant et en cliquant sur le bouton <em>Supprimer les d&eacute;finitions personnalis&eacute;es</em>&nbsp;;
si la d&eacute;finition supprim&eacute;e red&eacute;finissait un type standard, la
d&eacute;finition standard sera restaur&eacute;e. Vous ne pouvez pas effacer
les types d'entr&eacute;es standard.

<p>Noter qu'il n'y a pas de fonction d'annulation lorsque vous
cr&eacute;ez, modifiez ou supprimez des d&eacute;finitions de type d'entr&eacute;es.

<p> Quand vous s&eacute;lectionnez un des types standard de la liste
de types, la syntaxe d&eacute;finissant les champs requis et optionnels
devrait vous appara&icirc;tre &eacute;vidente&nbsp;; les noms de champs sont
simplement &eacute;crits dans l'ordre que vous souhaitez, s&eacute;par&eacute;s par
des points-virgules. [NdT sauf le dernier champ de la liste][NdT: &ccedil;a n'a pas vraiment l'air de marcher
comme &ccedil;a ... Pourquoi ?]

N'importe laquelle des listes de <em>Champs requis</em> et
<em>Champs optionnels</em> peut &ecirc;tre vide, s'il se trouve
qu'aucun des champs ne correspond &agrave; cette cat&eacute;gorie.
Les champs list&eacute;s n'ont pas &agrave; &ecirc;tre les champs standard connus
de JabRef.


<h2>Red&eacute;finir les types d'entr&eacute;es standard</h2>
    
Si vous sauvez la d&eacute;finition d'un type d'entr&eacute;es avec un nom identique 
&agrave; celui d'un des types standard, le type personnalis&eacute; sera
prioritaire sur le type standard. Vous pouvez utiliser cette
propri&eacute;t&eacute; pour red&eacute;finir l'ordre dans lequel les champs apparaissent
dans l'&eacute;diteur, ajouter de nouveaux champs que vous utilisez, supprimer
des champs qui ne vous int&eacute;ressent pas et m&ecirc;me d&eacute;placer tous les 
champs dans la liste des <em>Champs requis</em> afin de ne pas avoir
&agrave; changer d'onglet lorsque vous &eacute;ditez des entr&eacute;es.


Il y a une limitation &agrave; la personnalisation des entr&eacute;es&nbsp;; certains
types ont une condition "et/ou" dans les champs requis. Par exemple, 
une entr&eacute;e <em>book</em> est compl&egrave;te lorsque au moins un des champs
<em>author</em> ou <em>editor</em> est rempli. Ce type de condition
ne peut pas &ecirc;tre introduite dans une entr&eacute;e personnalis&eacute;e.

Si vous supprimez une version personnalis&eacute;e d'un type d'entr&eacute;e standard,
la d&eacute;finition standard sera restaur&eacute;e.
  </body>
</html>
