<HTML>

<BODY text="#275856">
<basefont size="4" color="#2F4958" face="arial">

<H1>Les liens PDF/PS/URL/DOI dans JabRef</H1>

JabRef vous permet de lier vos entr&eacute;es avec des fichiers PDF ou PS stock&eacute;s
sur votre ordinateur, ainsi que de cr&eacute;er des liens vers des documents sur
internet par l'interm&eacute;diaire d'une URL ou d'un identifiant DOI.

<H2>Configurer les visionneurs externes</H2>

Le programme doit savoir quels visionneurs externes utiliser pour les fichiers
PDF et PS ainsi que pour les pages internet. Ils sont par d&eacute;faut configur&eacute;s
avec des valeurs qui fonctionnent probablement avec votre syst&egrave;me d'exploitation&nbsp;;
aussi, il est tr&egrave;s possible que vous n'ayez pas besoin de changer ces valeurs
<p>Pour changer la configuration des visionneurs externes, allez dans le menu
<b>Options/ Pr&eacute;f&eacute;rences -> G&eacute;n&eacute;ral</b>.

<H2>Ouvrir des fichiers externes ou des liens</H2>

Il y a plusieurs fa&ccedil;ons d'ouvrir un fichier externe ou une page internet.
Dans l'&eacute;diteur d'entr&eacute;es, vous pouvez double-cliquer sur le texte du champ
contenant le nom du fichier, le DOI ou l'URL. Dans le tableau des entr&eacute;es,
vous pouvez s&eacute;lectionner une entr&eacute;e et utiliser le menu (<b>Outils/ Ouvrir
PS ou PDF</b> et <b>Outils/ Ouvrir URL ou DOI</b>), le raccourci clavier
ou le menu contextuel (avec un clic droit). Enfin, vous pouvez cliquer
sur les ic&ocirc;nes PDF, PS, URL ou DOI de la barre d'outils.

<P>Par d&eacute;faut, le tableau des entr&eacute;es contient deux colonnes dans
lesquelles des ic&ocirc;nes s'affichent pour les entr&eacute;es poss&eacute;dant un lien
vers un fichier externe ou une URL. La seconde colonne du tableau
montre les ic&ocirc;nes qui ouvrent les fichiers PDF et PS (uniquement
le fichier PDF si les deux fichiers sont pr&eacute;sents), 
et la troisi&egrave;me colonne montre les ic&ocirc;nes
ouvrant les URL et les DOI (uniquement l'URL si les deux liens sont
pr&eacute;sents). Vous ouvrez le fichier ou la page internet en cliquant
sur une de ces ic&ocirc;nes. Vous pouvez d&eacute;sactiver n'importe laquelle de ces
fonctions en utilisant le menu <b>Options/ Pr&eacute;f&eacute;rences -> Table des
entr&eacute;es</b>. 

<H2>Le r&eacute;pertoire PDF principal</H2>

Les fichiers PDF ont un traitement particulier afin de les relier aussi
facilement que possible &agrave; vos entr&eacute;es. Pour b&eacute;n&eacute;ficier de cette fonction,
vous devez d&eacute;finir un r&eacute;pertoire comme r&eacute;pertoire PDF principal dans
le menu <b>Options -> Pr&eacute;f&eacute;rences -> Programmes externes</b>.
Tous les fichiers PDF qui sont stock&eacute;s dans ou en dessous de ce r&eacute;pertoire
seront r&eacute;f&eacute;renc&eacute;s par un chemin relatif. Il vous sera ainsi facile 
de d&eacute;placer le r&eacute;pertoire PDF principal ou de partager votre base de donn&eacute;es
avec d'autres utilisateurs situ&eacute;s en des points diff&eacute;rents du r&eacute;seau.

<P>De plus, si vous donnez &agrave; vos fichiers PDF des noms qui correspondent &agrave;
la clef BibTeX des entr&eacute;es (plus '.pdf'), JabRef sera capable de rechercher
dans le r&eacute;pertoire PDF principal et ses sous-r&eacute;pertoires le bon fichier PDF.
Lorsqu'un fichier PDF (nomm&eacute; correctement) est dans le r&eacute;pertoire,
vous acc&eacute;der &agrave; cette fonction en cliquant sur le bouton 'Auto' situ&eacute; &agrave;
cot&eacute; du champ PDF de l'&eacute;diteur d'entr&eacute;es. Si le fichier PDF est trouv&eacute;,
le champ sera imm&eacute;diatement rempli.

<P>Si vous nommez le PDF comme mentionn&eacute; ci-dessus, vous pourrez aussi
ouvrir le fichier PDF sans configurer pr&eacute;alablement le champ PDF.
Cependant, dans ce cas, l'ic&ocirc;ne PDF n'appara&icirc;tra pas dans le tableau
des entr&eacute;es.

</HTML>
