<HTML>

<BODY text="#275856">
<basefont size="4" color="#2F4958" face="arial">

<H1>Utilisation des <em>Groupes</em></H1>
<em>Cette fonction est accessible depuis l'interface des groupes du panneau lat&eacute;ral.
L'interface des groupes peut &ecirc;tre activ&eacute;e et d&eacute;sactiv&eacute;e en appuyant sur CTRL-SHIFT-G.
[NdT: mais aussi par le menu Affichage ainsi que par une icône de la barre d'outils]</em>

<p>Les <em>Groupes</em> sont une fonction qui permet d'organiser votre base
de donn&eacute;es <em>BibTeX</em> en groupes logiques. Les groupes sont impl&eacute;ment&eacute;s
d'une mani&egrave;re tr&egrave;s simple&nbsp;: une fois que vous avez s&eacute;lectionn&eacute; un ou plusieurs
groupes, JabRef traite un champ par entr&eacute;e (ce champ est configur&eacute; dans la d&eacute;finition des
groupes) et v&eacute;rifie s'il contient l'expression r&eacute;guli&egrave;re du groupe [NdT: pas tr&egrave;s clair...],
puis vous affiche soit les entr&eacute;es appartenant aux groupes s&eacute;lectionn&eacute;s
(intersection de groupes), soit les entr&eacute;es appartenant &agrave; n'importe
lequel des groupes s&eacute;lectionn&eacute;s (union de groupes).

<p>Le choix <em>All Entries</em> [NdT: actuellement non traduit dans JabRef] sera toujours en t&ecirc;te de la liste
des groupes. Cliquez sur ce choix pour d&eacute;s&eacute;lectionner les autres groupes.
Vos groupes s&eacute;lectionn&eacute;s seront aussi d&eacute;s&eacute;lectionn&eacute;s si vous fermez
l'interface des groupes.

<p>Puisque vos d&eacute;finitions de groupes seront sp&eacute;cifiques &agrave; chaque base
de donn&eacute;es, elles sont sauvegard&eacute;es dans votre fichier .bib. Cette
information sera incluse dans un bloc @COMMENT de BibTeX 
qui sera alors ignor&eacute; par le programme <em>BibTeX</em>.
Changer le contenu de ce bloc manuellement pourrait (bien entendu)
causer la perte ou la modification de vos d&eacute;finitions de groupes.

<H2>Diff&eacute;rentes fa&ccedil;ons d'utiliser les <em>groupes</em></H2>

<p>La fonction Groupes pourrait sembler un peu d&eacute;routante
au d&eacute;but. Elle est construite de fa&ccedil;on &agrave; assurer autant
de flexibilit&eacute; que possible&nbsp;: 

<p>Si vous voulez que vos groupes soient clairs et simples, vous pouvez
d&eacute;finir vos groupes en utilisant un nom de champ non-standard, tel
que 'supersnill' [NdT: supersnill?] ou n'importe quoi d'autre, et simplement utiliser
les fonctions <em>Ajouter au groupe</em> et <em>Supprimer du groupe</em>
pour assigner des entr&eacute;es &agrave; ces groupes.

<p>Cependant, si votre base de donn&eacute;es poss&egrave;de d&eacute;j&agrave; des mots-clefs
pertinents, vous pourriez vouloir d&eacute;finir certains groupes en
utilisant le champ 'keywords'. Votre base de donn&eacute;es peut
alors &ecirc;tre group&eacute;e pour vous.

<p>Une troisi&egrave;me option est de d&eacute;finir certains groupes &agrave; partir
de champs habituels - par exemple, pour d&eacute;finir des recherches
rapides sur des auteurs particuliers et importants pour
votre travail. Si vous fa&icirc;tes cela, vous devrez &eacute;viter d'utiliser
les fonctions <em>Ajouter au groupe</em> et <em>Supprimer du
groupe</em>, puisque vous ne voulez probablement pas que le champ
soit modifi&eacute;. Un avertissement sera affich&eacute; si vous tentez
cette op&eacute;ration.

<H2>Afficher et chercher dans les groupes</H2>

<p>Pour voir les entr&eacute;es d'un groupe, cliquez sur le nom du groupe.
Quand l'interface des groupes est accessible au clavier, vous
pouvez naviguer entre les groupes en utilisant les fl&egrave;ches du
clavier HAUT et BAS. En utilisant MAJ et CONTROL, vous pouvez
s&eacute;lectionner plusieurs groupes &agrave; la fois. Les menus &agrave; coches
<em>Intersection</em> et <em>Union</em> d&eacute;terminent la fa&ccedil;on
dont une s&eacute;lection de plusieurs groupes est trait&eacute;e [NdT: Quid
des autres &eacute;l&eacute;ments du menu Param&egrave;tres ?].
 
<p>Notez qu'afficher un groupe est en fait une action
similaire &agrave; une recherche. Cela signifie que si vous ajoutez 
de nouvelles entr&eacute;es &agrave; un groupe, vous devrez mettre &agrave; jour
la recherche afin que les entr&eacute;es soient affich&eacute;es comme faisant
partie du groupe. Par exemple, vous devrez res&eacute;lectionner vos
groupes actuels, ou cliquer sur le bouton <em>Rafra&icirc;chir
la vue</em>.

<p>La fonction Groupes peut &ecirc;tre combin&eacute;e avec les recherches
ordinaires&nbsp;; toutes les recherches seront alors limit&eacute;es
aux entr&eacute;es appartenant &agrave; votre s&eacute;lection de groupes. Lorsqu'une
recherche est active, vous pouvez naviguez entre les groupes ou
affichez toutes les entr&eacute;es&nbsp;; le tableau sera mis &agrave; jour
pour montrer les correspondances &agrave; l'int&eacute;rieur des groupes
actuellement s&eacute;lectionn&eacute;s.

<p>A tout moment, vous pouvez exporter une base de donn&eacute;es
<em>BibTeX</em> contenant uniquement les entr&eacute;es appartenant
aux groupes s&eacute;lectionn&eacute;s et/ou &agrave; la recherche en cours en 
choisissant dans le menu <em>Fichier -> Sauvegarde sp&eacute;ciale</em>
[NdT menu <em>Fichier -> Sauvegarder la s&eacute;lection sous...</em>&nbsp;?].

<H2>Cr&eacute;er un nouveau groupe</H2>

<p>
[NdT: l'interface de cr&eacute;ation des groupes a chang&eacute; depuis la version 1.7b]
</p>

<p>Pour d&eacute;finir un groupe, appuyer sur le bouton <em>Nouveau groupe</em> 
dans l'interface des groupes. Une fen&ecirc;tre de dialogue appara&icirc;t,
&agrave; l'int&eacute;rieur de laquelle vous pouvez entrer le nom du groupe,
une expression r&eacute;guli&egrave;re, et un nom de champ. Le nom du champ
sera initialis&eacute; &agrave; une valeur par d&eacute;faut qui peut &ecirc;tre chang&eacute;e
dans le menu <em>Options -> Pr&eacute;f&eacute;rences</em> [NdT: puis dans G&eacute;n&eacute;ral].
Pour terminer la cr&eacute;ation de votre nouveau groupe, appuyez sur Entr&eacute;e
dans un des champs de texte, ou cliquez sur <em>Ok</em>. Pour quitter
sans cr&eacute;er le groupe, appuyer sur ESCAPE ou cliquer sur <em>Annuler</em>.

<H2>Modifier la d&eacute;finition d'un groupe existant</H2>

<p>Pour modifier la d&eacute;finition d'un groupe existant, double-cliquez
sur le nom du groupe dans l'interface des groupes, ou faites
un clic droit sur son nom et choisissez <em>Editer le groupe</em>.
La bo&icirc;te de dialogue utilis&eacute;e pour cr&eacute;er de nouveaux groupes 
s'affichera, vous permettant de modifier le nom du groupe. Le nom
de champ et l'expression r&eacute;guli&egrave;re ne peuvent pas &ecirc;tre modifi&eacute;s
apr&egrave;s la cr&eacute;ation du groupe (cette restriction sera probablement
lev&eacute;e une fois que nous aurons trouv&eacute; une m&eacute;thode qui puisse
mettre &agrave; jour les entr&eacute;es de groupe pour vous, pour &eacute;viter que les 
entr&eacute;es ne sortent du groupe modifi&eacute; [NdT: cela a l'air op&eacute;rationnel &agrave; pr&eacute;sent]).

<H2>Ajouter des entr&eacute;es &agrave; un groupe</H2>

<p>L'appartenance d'une entr&eacute;e &agrave; un groupe d&eacute;pend de la correspondance entre
l'expression r&eacute;guli&egrave;re du groupe et le contenu du champ sp&eacute;cifi&eacute; de cette entr&eacute;e.
Ainsi, pour ajouter une entr&eacute;e &agrave; un groupe, vous devez simplement vous
assurer que c'est le cas.

<p>Au lieu d'&eacute;diter le champ manuellement, vous pouvez s&eacute;lectionner
les entr&eacute;es que vous souhaitez ajouter, et faire un clic droit pour
afficher le menu contextuel. Dans ce menu, choisissez
<em>Ajouter au groupe</em> et s&eacute;lectionner ensuite le groupe d&eacute;sir&eacute;&nbsp;;
les entr&eacute;es qui ne sont pas encore incluses dans le groupe seront
ajout&eacute;es pour vous.

<H2>Supprimer des entr&eacute;es d'un groupe</H2>

<p>Le principe utilis&eacute; pour l'ajout d'entr&eacute;es s'applique pour
les supprimer. Supprimez toutes correspondances pour l'expression
r&eacute;guli&egrave;re du groupe &agrave; partir du champ sp&eacute;cifi&eacute;, ou utilisez la
fonction <em>Supprimer du groupe</em>.

<H2>Supprimer un groupe</H2>

<p>Pour supprimer un groupe, faites un clic droit sur ce groupe et choisissez
<em>Supprimez les groupes</em>. Une fen&ecirc;tre vous demandera de confirmer
votre action.

<H2>G&eacute;n&eacute;ration automatique des groupes</H2>

<p>En cliquant sur le bouton <em>Cr&eacute;er automatiquement des groupes pour
la base</em>, vous pouvez rapidement avoir une s&eacute;rie de groupes
appropri&eacute;s pour votre base de donn&eacute;es. Cette fonction va collecter
tous les mots trouv&eacute;s dans le champ que vous sp&eacute;cifiez et cr&eacute;er
un groupe pour chaque mot. Ceci est utile par exemple si votre
base de donn&eacute;es contient des mots clefs pertinents pour toutes
ses entr&eacute;es. En g&eacute;n&eacute;rant automatiquement des groupes bas&eacute;s
sur le champ <em>keywords</em>, vous devriez obtenir sans effort une
s&eacute;rie de groupes appropri&eacute;s. 

<p>Vous pouvez aussi sp&eacute;cifier des caract&egrave;res &agrave; ignorer, par exemple
les virgules utilis&eacute;es entre les mots clefs. Ces caract&egrave;res seront
alors trait&eacute;s comme des s&eacute;parateurs de mots et non comme faisant
partie d'eux. Vous ne pouvez pas utiliser cette option pour
supprimer des mots entiers.

<p>La fonction d'autog&eacute;n&eacute;ration sera am&eacute;lior&eacute;e par de futurs d&eacute;veloppements.

</HTML> 
