<html xmlns="http://www.w3.org/1999/xhtml">

<body text="#275856">
    <basefont size="4" color="#2F4958" face="arial" />

    <h1>Utiliser les bibliographies JabRef dans
    OpenOffice.org</h1>

    <p>JabRef peut exporter votre base de
    donn&eacute;es dans le format de tableur OpenOffice.org 1.1
    <b>.sxc</b> ainsi que dans le format OpenDocument <b>.ods</b>
    utilis&eacute; par OpenOffice.org 2.</p>

    <p>Dans les deux cas, la table export&eacute;e contiendra une
    feuille de calcul, listant les entr&eacute;es selon les lignes
    et les diff&eacute;rents champs en colonnes. L'ordre et les
    noms des colonnes sont configur&eacute;s pour &ecirc;tre
    compatible avec les fonctions bibliographiques d'OpenOffice.org
    (OOo 1.1 dans le cas d'une exportation au format <b>.sxc</b>,
    et OOo 2 pour une exportation au format <b>.ods</b>).</p>


    En fonction de la version d'OpenOffice.org, voici la fa&ccedill;on d'utiliser les bibliographies JabRef&nbsp;:

    <h2>Utiliser le fichier export&eacute; comme une base de
    donn&eacute;es bibliographique dans OpenOffice.org 2.3 et 2.4</h2>
    
    <p>Suivez les &eacute;tapes suivantes pour
    configurer une feuille de calcul export&eacute;e par JabRef
    comme une base de donn&eacute;es bibliographique dans
    OpenOffice.org&nbsp;:</p>
     
    <ul>
    <li>Depuis JabRef, exporter votre base en utilisant le format <b>.ods</b></li>
    <li>D&eacute;marrer OpenOffice.org Writer</li>
    <li>Choisir <b>Edition -&gt; Changer de bases de donn&eacute;es</b>. Cliquer sur <b>Parcourir</b>, puis s&eacute;lectionner votre base export&eacute;e au format .ods.</li>
    <li>D&eacute;rouler le <b>+</b> plac&eacute; devant le nom de la base import&eacute;e puis cliquer sur le nom du fichier qui appara&icirc;t, et enfin sur le bouton  <b>D&eacute;finir</b>.</li>
    <li>Choisir <b>Outils -&gt; Options -&gt; OpenOffice.org Base -&gt; Base de donn&eacute;es</b>. Dans cette fen&ecirc;tre, la base de donn&eacute;es que vous avez import&eacute;e doit appara&icirc;tre, ainsi que la base de donn&eacute;es bibliographique par d&eacute;faut (<i>Bibliography</i>).</li>
    <li>&Eacute;diter la base de donn&eacute;es Bibliography, et lui donner un autre nom, tel que <i>Bibliography-old</i> (en effet OpenOffice.org Writer ne permet pas de choisir entre plusieurs bibliographies).
    <li>S&eacute;lectionner votre base de donn&eacute;es bibliographique, l'&eacute;diter et la renommer <i>Bibliography</i> en faisant attention &agrave; la graphie du mot (majuscule en d&eacute;but de nom).</li>
    </ul>

    Apr&egrave;s avoir effectu&eacute; ces &eacute;tapes, votre base de donn&eacute;es bibliographique devrait &ecirc;tre pr&ecirc;te &agrave; &ecirc;tre utilis&eacute;e avec OpenOffice.org. Pour le v&eacute;rifier, s&eacute;lectionner <b>Insertion -&gt; Index -&gt; Entr&eacute;e de bibliographie...</b>&nbsp;: la liste de cl&eacute;s BibTeX doit appara&icirc;tre.


    <h2>Utiliser le fichier export&eacute; comme une base de
    donn&eacute;es bibliographique dans OpenOffice.org 2.0, 2.1 et 2.2</h2>

    <p>Suivez les &eacute;tapes suivantes pour
    configurer une feuille de calcul export&eacute;e par JabRef
    comme une base de donn&eacute;es bibliographique dans
    OpenOffice.org&nbsp;:</p>

    <ul>
        <li>Exporter votre base en utilisant le format
        <b>.ods</b></li>

        <li>D&eacute;marrer OpenOffice.org Writer</li>

        <li>Choisir <b>Outils -&gt; Options -&gt; OpenOffice.org
        Base -&gt; Base de donn&eacute;es</b></li>

        <li>&Eacute;diter la base de donn&eacute;es
        <i>Bibliography</i>, et lui donner un autre nom, tel que
        <i>Bibliography-old</i> (en effet OpenOffice.org Writer ne
        permet pas de choisir entre plusieurs bibliographies)</li>

        <li>Fermer la fen&ecirc;tre <b>Options</b> et choisir
        <b>Fichier -&gt; Nouveau -&gt; Base de
        donn&eacute;es</b></li>

        <li>Choisir <b>Se connecter &agrave; une base de
        donn&eacute;es existante</b>, s&eacute;lectionner
        <b>Classeur</b> comme type de base de donn&eacute;es,
        cliquer sur <b>Suivant</b> et choisir le fichier
        <b>.ods</b> que vous avez export&eacute;.</li>

        <li>Cliquer sur <b>Terminer</b>, puis choisir le nom
        <i>Bibliographie</i> quand demand&eacute;.</li>
    </ul>Apr&egrave;s avoir effectu&eacute; ces &eacute;tapes,
    choisir <b>Outils -&gt; Base de donn&eacute;es
    bibliographique</b>. Votre base de donn&eacute;es devrait
    maintenant s'afficher.

    <h2>Utiliser le fichier export&eacute; comme une base de
    donn&eacute;es bibliographique dans OpenOffice.org 1.1.x</h2>

    <ul>
        <li>Exporter votre base de donn&eacute;es vers le format
        <b>.sxc</b></li>

        <li>D&eacute;marrer OpenOffice.org Texte</li>

        <li>Choisir <b>Outils -&gt; Sources de
        donn&eacute;es...</b></li>

        <li>S&eacute;lectionner la base de donn&eacute;es
        <i>Bibliography</i> et lui donner un autre nom, tel que
        <i>Bibliography-old</i>. Cliquer sur <b>Appliquer</b>.</li>

        <li>Cliquer sur <b>Nouvelle source de donn&eacute;es</b>.
        Une nouvelle entr&eacute;e appara&icirc;t. La renommer
        <i>Bibliography</i>.</li>

        <li>Changer le <b>type de BD</b> en <b>Classeur</b>.
        Cliquer le bouton <b>...</b> au bout de la ligne <b>URL de
        la source de donn&eacute;es</b>. Choisir le fichier
        <b>.sxc</b> que vous avez export&eacute;.</li>

        <li>Cliquer sur <b>OK</b> pour fermer la fen&ecirc;tre
        <b>Gestion des sources de donn&eacute;es</b>.</li>
    </ul>Apr&egrave;s avoir effectu&eacute; ces &eacute;tapes,
    choisir <b>Outils -&gt; Base de donn&eacute;es
    bibliographique</b>. Votre base de donn&eacute;es devrait
    maintenant s'afficher.
</body>
</html> 
