<HTML>

<BODY text="#275856">
<basefont size="4" color="#2F4958" face="arial">

<H1>Exportfilter anpassen</H1>

Mit JabRef k&ouml;nnen Sie Ihre eigenen Exportfilter definieren und genau so wie die
Standard-Exportfilter benutzen. Ein Exportfilter wird durch eine oder mehr <i>Layout-Dateien</i>
definiert, die mittels eingebauter Formatierprogramme das Format der exportierten Dateien
festlegen. Ihre Layout-Datei m&uuml;ssen Sie in einem separaten Texteditor erstellen.

<H2>Hinzuf&uuml;gen eines Exportfilters</H2>

Die einzige Voraussetzung f&uuml;r einen Exportfilter ist, da&szlig; eine Datei mit der
Endung <b>.layout</b> vorhanden ist. Um einen neuen, eigenen Exportfilter hinzuzuf&uuml;gen,
&ouml;ffnen Sie das Dialogfenster <b>Optionen -> Verwalte externe Exportfilter</b> und klicken
auf die Schaltfl&auml;che <b>Neu</b>. Es &ouml;ffnet sich ein neues Fenster, in dem Sie einen
Namen (der im Men&uuml; <b>Datei -> Externe Exportfilter</b> angezeigt wird), eine Pfadangabe
zur <b>.layout</b>-Datei und die gew&uuml;nschte Dateiendung f&uuml;r den Exportfilter angeben
k&ouml;nnen. Wenn Sie den Exportfilter benutzen, wird diese Endung im Datei-Dialog automatisch
vorgeschlagen.

<H2>Das Erstellen des Exportfilters</H2>

Um einen Eindruck zu bekommen, wie Exportfilter auszusehen haben, suchen Sie am besten auf unserer
Homepage nach dem Paket, das die Layout-Dateien der Standard-Exportfilter enth&auml;lt.

<H3>Layout-Dateien</H3>

Nehmen wir einmal an, dass wir einen HTML-Exportfilter erstellen wollen.

<P>Der Exportfilter muss lediglich aus einer einzigen <b>.layout</b>-Datei bestehen, die in diesem
Fall <i>html.layout</i> genannt werden k&ouml;nnte. Sie k&ouml;nnen dar&uuml;ber hinaus auch zwei
Dateien mit den
Namen <i>html.begin.layout</i> und <i>html.end.layout</i> anlegen. Die erste dieser beiden Dateien
enth&auml;lt den Kopfteil der Ausgabe, die zweite den Fu&szlig;teil. JabRef sucht jedes Mal, wenn der
Exportfilter benutzt wird, nach diesen Dateien und f&uuml;gt sie&nbsp;&ndash; falls sie gefunden
werden&nbsp;&ndash; w&ouml;rtlich vor bzw. nach den einzelnen Eintr&auml;gen in die Ausgabe ein.

<P>Beachten Sie, dass sich diese Dateien in demselben Verzeichnis wie <i>html.layout</i> befinden
m&uuml;ssen und die Namensbestandteile <b>.begin</b> bzw. <b>.end</b> enthalten m&uuml;ssen.

<P>In unserem Beispiel-Exportfilter k&ouml;nnten diese Dateien folgenderma&szlig;en aussehen:

<p><i>html.begin.layout</i>:<br>
<code>&lt;HTML&gt;<br>
  &lt;BODY&gt; text="#275856"&gt;<br>
&lt;basefont size="4" color="#2F4958" face="arial"&gt;</code>

<p><i>html.end.layout</i>:<br>
<code>&lt;/BODY&gt;<br>
  &lt;/HTML&gt;</code>

<P>Die Datei <i>html.layout</i> stellt die <i>Standard</i>-Formatvorlage f&uuml;r den Export
eines einzelnen Eintrags bereit. Falls Sie unterschiedliche Formatvorlagen f&uuml;r verschiedene
Eintragstypen anwenden wollen, m&uuml;ssen Sie Eintrags-spezifische <b>.layout</b>-Dateien erstellen.
Diese m&uuml;ssen sich ebenfalls in demselben Verzeichnis wie die Haupt-Layout-Datei befinden und
den Namensbestandteil <b>.entrytype</b> enthalten. Der Name des Eintragstyps muss komplett in
Kleinbuchstaben geschrieben werden. In unserem Beispiel wollen wir eine Formatvorlage f&uuml;r
Eintr&auml;ge des Typs "book" haben, die in der Datei <i>html.book.layout</i> abgelegt wird.
F&uuml;r eine Dissertation w&uuml;rden wir die Datei <i>html.phdthesis.layout</i> anlegen&nbsp;&ndash;
und so weiter. Diese Dateien sind der Standard-Layout-Datei sehr &auml;hnlich, nur dass sie lediglich
f&uuml;r Eintr&auml;ge des entsprechenden Typs genutzt werden. Beachten Sie, dass die
Standard-Layout-Datei so allgemein gehalten werden kann, dass sie die meisten
Eintragstypen abdeckt.

<H3>Das Format der Layout-Datei</H3>

Layout-Dateien werden mit einem einfachen markup-Format erstellt, bei dem die Kommandos mit
einem "backslash" (<code>\</code>) eingeleitet werden. Alle Textbestandteile, die nicht als
Kommando identifiziert werden, gelangen direkt in die Ausgabedatei.

<H3>Feldkommandos</H3>

<p>Ein beliebiges Wort, vor dem ein backslash steht, z.B. <code>\author</code>, <code>\editor</code>,
<code>\title</code> or <code>\year</code>, wird als Verweis auf das entsprechende Feld ausgewertet,
das dann direkt in die Ausgabe kopiert wird.

<H3>Feldformatierer</H3>

<p>Oft muss der Feldinhalt vor der Ausgabe verarbeitet werden. Dies wird mit Hilfe eines
<i>Feldformatierers</i> gemacht - einer java class, die eine Methode zur Verarbeitung des
Feldinhaltes enth&auml;lt.
<p>Ein Formatierer wird angewendet, indem man das Kommando <code>\format</code> gefolgt vom Namen
des Formatierers in eckigen Klammern und dem Feldnamen in geschweiften Klammern einf&uuml;gt, z.B.:

  <p><code>\format[ToLowerCase]{\author}</code>

<p>Sie k&ouml;nnen auch mehrere Formatierer angeben, getrennt durch Kommas. Sie werden nacheinander
aufgerufen, und zwar von links nach rechts. Das Kommando

  <p><code>\format[ToLowerCase,HTMLChars]{\author}</code>

<p>ruft z.B. zun&auml;chst den Formatierer <b>ToLowerCase</b> auf, <b>HTMLChars</b> formatiert
anschlie&szlig;end das Ergebnis. Auf diese Weise k&ouml;nnen Sie eine beliebige Anzahl an
Formatierern auflisten.

<p>JabRef bietet die folgenden Formatierer, wobei einige von anderen abh&auml;ngen:

<ul>
<li><code>HTMLChars</code> : ersetzt TeX-spezifische Sonderzeichen (z.B. {\^a} oder {\"{o}})
  durch ihre HTML-Entsprechungen.
<li><code>XMLChars</code> : ersetzt TeX-spezifische Sonderzeichen (z.B. {\^a} oder {\"{o}})
  durch ihre XML-Entsprechungen.
<li><code>CreateDocBookAuthors</code> : formatiert das author-Feld im DocBook-Stil.
<li><code>AuthorFirstFirst</code> : formatiert die Felder author/editor mit den Vornamen zuerst.
<li><code>AuthorFirstFirstCommas</code> : formatiert die Felder author/editor mit den Vornamen zuerst
und abgetrennt durch Kommas.
<li><code>AuthorLastFirst</code> : formatiert die Felder author/editor mit den Nachnamen zuerst.
<li><code>AuthorLastFirstAbbreviator</code> : k&uuml;rzt die Vornamen aller Autoren.
Dieser Formatierer kann nur angewendet werden, wenn <code>AuthorLastFirst</code> bereits benutzt wurde.
<li><code>AuthorAndsReplacer</code> : ersetzt "and" zwischen den Namen durch ";", zwischen den letzten beiden Autoren steht "&amp;".
<li><code>AuthorAndsCommaReplacer</code> : ersetzt "and" zwischen den Namen durch "," sowie "&" zwischen den beiden letzten.
<li><code>FormatPagesForHTML</code> : ersetzt "--" durch "-".
<li><code>FormatPagesForXML</code> : ersetzt "--" durch einen XML en-dash (Gedanken- bzw. Bis-Strich).
<li><code>RemoveBrackets</code> : entfernt alle geschweiften Klammern "{" oder "}".
<li><code>RemoveLatexCommands</code> : entfernt LaTeX Kommandos wie <code>\em</code>, <code>\textbf</code>
etc. Zusammen mit <code>HTMLChars</code> oder <code>XMLChars</code> sollte dieser Formatierer
zuletzt aufgerufen werden.
<li><code>ToLowerCase</code> : macht aus allen Buchstaben Kleinbuchstaben.
</ul>

<p>Falls keiner der verf&uuml;gbaren Formatierer das Ergebnis erzielt, das Sie erreichen m&ouml;chten,
k&ouml;nnen Sie Ihren eigenen Formatierer hinzuf&uuml;gen, indem Sie das
<code>net.sf.jabref.export.layout.LayoutFormatter</code>-Interface implementieren. Wenn Sie Ihre Klasse
(class) in das Paket <code>net.sf.jabref.export.layout.format</code> einf&uuml;gen, k&ouml;nnen Sie
den Formatierer mit seinem Klassennamen aufrufen, so wie auch die Standard-Formatierer. Ansonsten
m&uuml;ssen Sie den Formatierer mit seinem vollen Namen aufrufen (inklusive Paketname). In jedem Fall
muss der Formatierer in ihrem classpath sein, wenn Sie JabRef starten.

<H3>Bedingte Ausgabe</H3>

Manche statische Ausgabe macht nur Sinn, wenn ein bestimmtes Feld nicht leer ist. Wenn wir z.B. hinter
den Namen der Editoren den Text <code>(Hrsg.)</code> haben wollen, brauchen wir folgendes:

<p><code>\format[HTMLChars,AuthorFirstFirst]{\editor} (Hrsg.)</code>

<p>Wenn nun aber das <code>editor</code>-Feld leer ist - m&ouml;glicherweise ist es f&uuml;r den Eintrag,
der exportiert werden soll, nicht erforderlich -, dann w&uuml;rde das <code>(Hrsg.)</code> dennoch
erscheinen. Das kann man mit den Kommandos <code>\begin</code> und <code>\end</code> verhindern:

<p><code>\begin{editor}<br>\format[HTMLChars,AuthorFirstFirst]{\editor} (Hrsg.)
<br>\end{editor}</code>

<p>Die Kommandos <code>\begin</code> und <code>\end</code> sorgen daf&uuml;r, dass der Text, den sie
einschlie&szlig;en, nur dann ausgegeben wird, falls das Feld, auf das in den geschweiften Klammern
verwiesen wird, f&uuml;r den zu exportierenden Eintrag definiert und damit nicht leer ist.

<p><b>Anmerkung:</b> Das Benutzen der Kommandos <code>\begin</code> und <code>\end</code> ist ein
Schl&uuml;ssel zum Erstellen von Layout-Dateien, die mit einer Vielzahl von Eintragstypen
umgehen k&ouml;nnen.

<H3>Gruppierte Ausgabe</H3>

Wenn Sie Ihre Eintr&auml;ge auf der Basis eines bestimmten Feldes gruppieren wollen, benutzen Sie
die Kommandos f&uuml;r die gruppierte Ausgabe.
Die gruppierte Ausgabe ist der bedingten Ausgabe sehr &auml;hnlich, au&szlig; dass der Text zwischen
den Kommandos nur ausgegeben wird, wenn das Feld, auf das in den geschweiften Klammern verwiesen wird,
unterschiedliche Werte enth&auml;lt.

<p>Nehmen wir zum Beispiel an, dass wir die Ausgabe nach dem keyword (Stichwort) gruppieren wollen.
Bevor die Datei exportiert wird, m&uuml;ssen die Eintr&auml;ge nach dem keyword sortiert worden sein.
Dann benutzen Sie die folgenden Kommandos, um nach keyword zu gruppieren:

<p><code>\begingroup{keywords}New Category: \format[HTMLChars]{\keywords}
<br>	\endgroup{keywords}</code>

<H2>Teilen Sie Ihre Arbeit mit anderen</H2>

Mit externen Layout-Dateien ist es einfach, Ihre eigenen Export-Formate mit anderen Anwendern
gemeinsam zu benutzen. Falls Sie einen Exportfilter f&uuml;r ein Format erstellen, das nicht von
JabRef unterst&uuml;tzt wird, oder falls Sie einen bestehenden Exportfilter verbessern, m&ouml;chten
wir Sie ermutigen, Ihre Arbeit auf der SourceForge.net-Seite bereitzustellen. Dasselbe gilt f&uuml;r
Formatierklassen, die Sie schreiben. Wir w&uuml;rden uns freuen, eine Sammlung von bereitgestellten
Layout-Dateien verteilen zu k&ouml;nnen oder die Standard-Export-Filter und Standard-Formatierer
 zu erweitern.

</HTML>