<HTML>

<BODY text="#275856">
<basefont size="4" color="#2F4958" face="arial">

<H1>Links zu PDF/PS/URL/DOI-Dateien in JabRef</H1>

Mit JabRef k&ouml;nnen Sie Ihre Eintr&auml;ge mit den entsprechenden PDF- oder PS-Dateien,
die sich auf Ihrem Computer befinden, verlinken. Ebenso ist es m&ouml;glich, Dateien
im Internet &uuml;ber ein URL oder DOI zu verlinken.

<H2>Externe Betrachter einrichten</H2>

JabRef ben&ouml;tigt Informationen dar&uuml;ber, welche Programme es f&uuml;r PDF- und PS-Dateien
und Internetseiten benutzen soll. In der Standardeinstellung werden sie auf Werte gesetzt, die
wahrscheinlich zu Ihrem Betriebssystem passen, so dass eine gute Chance besteht, dass Sie diese
Werte nicht zu ver&auml;ndern brauchen.

<p>Um die Einstellungen der externen Programme zu &auml;ndern, &ouml;ffnen Sie den Unterpunkt
<em>Externe Programme</em> im Dialog <em>Optionen -> Einstellungen</em>.

<H2>Externe Dateien oder Links &ouml;ffnen</H2>

Es gibt verschiedene M&ouml;glichkeiten, wie man externe Dateien oder Internetseiten aus JabRef &ouml;ffnen kann.
Im Eintrags-Editor k&ouml;nnen Sie einfach auf das Textfeld, das ein DOI oder URL enth&auml;lt, doppelklicken.
In der Tabellenansicht k&ouml;nnen Sie einen Eintrag ausw&auml;hlen und die Men&uuml;eintr&auml;ge (unter <em>Extras</em>),
die Tastenkombinationen (in der Standardeinstellung F4 f&uuml;r PDF/PS und F3 f&uuml;r DOI/URL) oder das Kontextmen&uuml;
(mit der rechten Maustaste) benutzen, um die Datei oder Internetseite zu &ouml;ffnen. Schlie&szlig;lich k&ouml;nnen Sie
auch auf ein PDF-, PS-, URL- oder DOI-Icon in der Tabelle klicken.

<P>In der Standardeinstellung zeigt die Tabellenansicht zwei Spalten mit Icons f&uuml;r die Eintr&auml;ge, die mit
externen Dateien oder URLs verlinkt sind. Beide Spalten k&ouml;nnen im Unterpunkt <em>Tabellenansicht</em> des
Dialogs <em>Optionen -> Einstellungen</em> ausgeblendet werden. Die zweite Spalte zeigt Icons f&uuml;r PDF- oder PS-Dateien
(nur PDF, wenn beide vorhanden sind), die dritte Spalte zeigt Icons f&uuml;r URL oder DOI (nur URL, wenn beide
vorhanden sind).

<H2>Der Standard-Ordner f&uuml;r PDF-Dateien</H2>

PDF-Dateien erhalten von JabRef eine "Spezialbehandlung", um das Verlinken mit den entsprechenden Eintr&auml;gen
so einfach wie m&ouml;glich zu gestalten. Um diese "Spezialbehandlung" nutzen zu k&ouml;nnen, m&uuml;ssen Sie im
Unterpunkt <em>Externe Programme</em> des Dialogs <em>Optionen -> Einstellungen</em> einen Ordner als
Standard-Ordner f&uuml;r Ihre PDF-Dateien angeben. Alle PDF-Dateien, die in diesem Ordner oder einem Unterordner
gespeichert sind, werden mit einer relativen Pfadangabe referenziert, so dass Sie problemlos PDF-Verzeichnisse
verschieben oder mit mehreren Benutzern von verschiedenen Netzwerkarbeitspl&auml;tzen aus an derselben
Datei arbeiten k&ouml;nnen.

<P>Wenn Sie Ihren PDF-Dateien dann noch Namen geben, die mit dem BibTeX Key des entsprechenden Eintrags
&uuml;bereinstimmen (plus '.pdf' im Dateinamen), sucht JabRef in Ihrem Standard-PDF-Ordner und dessen
Unterordnern nach der richtigen PDF-Datei. Sobald die korrekt benannte PDF-Datei sich dort befindet, klicken
Sie auf die Schaltfl&auml;che <em>Auto</em> neben dem PDF-Feld im Eintrags-Editor. Wenn die PDF-Datei gefunden wird,
wird das Feld entsprechend gesetzt.

<P>Wenn Sie eine PDF-Datei wie beschrieben benennen, k&ouml;nnen Sie sie auch &ouml;ffnen, ohne das PDF-Feld
&uuml;berhaupt zu benutzen. Der Nachteil ist in diesem Fall allerdings, dass das PDF-Icon in der Tabellenansicht
nicht angezeigt wird, solange das PDF-Feld leer bleibt.

</HTML>